#+title: Project 1
#+description: 
#+PROPERTY: header-args :tangle ./project1.py :padline 2
**** test
#+begin_src python :results output :session :tangle no
edata = [4, -4, 2, 2]
cdata = [0, 0, 0, 1]
print(standard_deviation(edata, cdata))
#+end_src

#+RESULTS:
: 3.0413812651491097



**** test
#+begin_src python :results output :session :tangle no
edata = [-4, 4, 2, 2]
cdata = [0, 0, 0, -5]
big = biggest_error(edata, cdata)
print(big)
#+end_src

#+RESULTS:
: 7



**** test
#+begin_src python :results output :session :tangle no
f = runge_kutta_method(lambda x,y: y, (0,1), 0.01)
print(f(1))
print("yello")
#+end_src

#+RESULTS:
: 2.718281828234403
: yello




**** test
#+begin_src python :results output :session :tangle no
f = heun_method(lambda x,y: y, (0,1), 0.1)
print(f(1))
print("yello")
#+end_src

#+RESULTS:
: 2.9990593355020874
: yello




***** test
#+begin_src python :results output :session :tangle no
f = euler_method(lambda x,y: y, (0,1), 0.1)
print(f(1))
print("ello")
#+end_src

#+RESULTS:
: 2.33436821409
: ello




*** test
#+begin_src python :results output :session :tangle no
print(F(1,2))
#+end_src

#+RESULTS:
: 1.0



*** Test
#+begin_src python :results output :session :tangel no
print(analytic_solution(3))
#+end_src

#+RESULTS:
: 42.110936250298195



